Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb.main has been deleted
- resource "aws_lb" "main" {
      - arn                        = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - arn_suffix                 = "app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - dns_name                   = "atlantis-lb-tf-545609256.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = true -> null
      - enable_http2               = true -> null
      - id                         = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - idle_timeout               = 60 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "atlantis-lb-tf" -> null
      - security_groups            = [
          - "sg-0d3ffc63bdbdbc728",
        ] -> null
      - subnets                    = [
          - "subnet-004d473b0f53df1f2",
          - "subnet-0598fd85c18906468",
        ] -> null
      - tags                       = {
          - "Environment" = "atlantis"
        } -> null
      - tags_all                   = {
          - "Environment" = "atlantis"
        } -> null
      - vpc_id                     = "vpc-06ed4f95b2d90bfde" -> null
      - zone_id                    = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-004d473b0f53df1f2" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0598fd85c18906468" -> null
        }
    }
  # aws_lb_listener_rule.listener_rule has been deleted
- resource "aws_lb_listener_rule" "listener_rule" {
      - arn          = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a/b7977c7e1f501977" -> null
      - id           = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a/b7977c7e1f501977" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a" -> null
      - priority     = 1 -> null
      - tags         = {} -> null
      - tags_all     = {} -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "atlantis.jmvbxx.com",
                ] -> null
            }
        }
    }
  # aws_lb_target_group.atlantis has been changed
~ resource "aws_lb_target_group" "atlantis" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-atlantis-lb-tg/223cbf91aca14da7"
        name                               = "tf-atlantis-lb-tg"
      + tags                               = {}
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_lb_target_group.main has been deleted
- resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - arn_suffix                         = "targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - name                               = "tf-main-lb-tg" -> null
      - port                               = 4141 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-06ed4f95b2d90bfde" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }
    }
  # aws_lb_listener.lb_listener has been deleted
- resource "aws_lb_listener" "lb_listener" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a" -> null
      - id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:loadbalancer/app/atlantis-lb-tf/2bf03333af158c1c" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> null
          - type             = "forward" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_lb.main will be created
+ resource "aws_lb" "main" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = true
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "atlantis-lb-tf"
      + security_groups            = [
          + "sg-0d3ffc63bdbdbc728",
        ]
      + subnets                    = [
          + "subnet-004d473b0f53df1f2",
          + "subnet-0598fd85c18906468",
        ]
      + tags                       = {
          + "Environment" = "atlantis"
        }
      + tags_all                   = {
          + "Environment" = "atlantis"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.lb_listener will be created
+ resource "aws_lb_listener" "lb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-atlantis-lb-tg/223cbf91aca14da7"
          + type             = "forward"
        }
    }

  # aws_lb_listener_rule.listener_rule will be created
+ resource "aws_lb_listener_rule" "listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-atlantis-lb-tg/223cbf91aca14da7"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "atlantis.jmvbxx.com",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.jmvbxx.com/lock?id=jmvbxx%252Fatlantis-ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
